gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/main.c
extern bool esc_notify_flag;
extern bool start_dw_flag;
extern bool drhc_notify_flag;
extern bool cdrc_notify_flag;
extern bool rdrc_notify_flag;
static dm_application_instance_t         m_app_handle;                              /**< Application identifier allocated by device manager */

static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}};
//static ble_uuid_t m_adv_uuids[] = {{PBS_SERVICE_SHORT_UUID, BLE_UUID_TYPE_VENDOR_BEGIN}};  // CAN'T USE

static int pktCounter = 0; // need change to variable

static uint16_t adv_counter;

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

//void flash_write_simulation(void)
//{
//	float cal_acc_test[3];	
//		cal_acc_test[0] = 12;
//		cal_acc_test[1] = 25;
//		cal_acc_test[2] = 30;			
//		int w_cnt = 600 * 3;
//		flash_data_set_init();	
//		while(w_cnt--) {
//				if (w_cnt == 1000) {
//					flash_data_set_write(NULL, cal_acc_test, 1, w_cnt);
//				} else if (w_cnt == 500) {
//					flash_data_set_write(NULL, cal_acc_test, 2, w_cnt);
//				}	else {
//					flash_data_set_write(NULL, cal_acc_test,0, 0);
//				}	
//		}
//		nrf_delay_ms(100);
//		pktCounter = 125;
//		m_pbs.esc_s.number_of_event = 1;
//		uint8_t esc_sim_data[3] = {0,0,1};
//		ble_pbs_esc_update(&m_pbs, esc_sim_data);
//		printf("flash write simulation\r\n");
//}

static ble_adv_mode_t                  m_adv_mode_current; /**< Variable to keep track of the current advertising mode. */
static ble_adv_modes_config_t          m_adv_modes_config;
static ble_gap_addr_t                  m_peer_address;     /**< Address of the most recently connected peer, used for direct advertising. */
static ble_advdata_t                   m_advdata;          /**< Used by the initialization function to set name, appearance, and UUIDs and advertising flags visible to peer devices. */
static ble_adv_evt_t                   m_adv_evt;

uint32_t ble_start_advertising(ble_adv_mode_t advertising_mode)
{
    uint32_t             err_code;
    ble_gap_adv_params_t adv_params;
    m_adv_mode_current = advertising_mode;
    uint32_t             count = 0;

    // Verify if there are any pending flash operations. If so, delay starting advertising until
    // the flash operations are complete.
    err_code = pstorage_access_status_get(&count);
    if (err_code == NRF_ERROR_INVALID_STATE)
    {
        // Pstorage is not initialized, i.e. not in use.
        count = 0;
    }
		else
		{
			printf("pstorage occupied:%i\r\n",count);
		}
		

    // Initialize advertising parameters with default values.
    memset(&adv_params, 0, sizeof(adv_params));

    adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
    adv_params.p_peer_addr = NULL;
    adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    adv_params.p_whitelist = NULL;
		adv_params.timeout  = m_adv_modes_config.ble_adv_fast_timeout;
    adv_params.interval = m_adv_modes_config.ble_adv_fast_interval;
		m_adv_evt = BLE_ADV_EVT_FAST;
    printf("Starting fast advertisement.\r\n");
            
    // Set advertising parameters and events according to selected advertising mode.
    err_code = sd_ble_gap_adv_start(&adv_params);
		VERIFY_SUCCESS(err_code);
    
}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */

static void dhrc_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
		//printf("timeout\r\n");
		// Start flash write simulation
	uint32_t err_code;
	if (adv_counter>0)
	{
		adv_counter--;
		printf("adv_counter:%i\r\n",adv_counter);
	}
	else
	{
		sd_ble_gap_adv_stop();
		err_code = ble_start_advertising(BLE_ADV_MODE_FAST);
		printf("adv_err:%04X\r\n",err_code);
		adv_counter = ADV_TOTAL_DURATION/TIMER_DURATION;
	}
	if (pktCounter == 0 && esc_notify_flag)
	{
		//flash_write_simulation();
	}
	// Simulator flash read
		uint32_t r_xy;
		uint32_t r_z;
		//uint8_t r_event_ID;
		//uint32_t r_UTC;
		int ret;
		uint16_t data_x[4] = {0};
		uint16_t data_y[4] = {0};
		uint16_t data_z[4] = {0};
		//uint8_t len = 0;
		uint8_t p_cal_encoded_buffer[20] = {0};
		p_cal_encoded_buffer[0] = pktCounter;
		p_cal_encoded_buffer[1] = 18;
		//uint32_t err_code;
		uint8_t pktNum=0;
		if (pktCounter > 0 && cdrc_notify_flag== true && start_dw_flag)
		{
			if (pktCounter == 125) // The first data packet
				nrf_delay_ms(200);
			printf("pktCounter : %i ",pktCounter);
			pktCounter--;

			// Simulator flash read, assign to uint16_t array
			for(int i=0;i<4;i++)
			{
				//ret=flash_data_set_read(NULL, NULL, &r_xy, &r_z, &r_event_ID, &r_UTC);
				data_x[i] = (uint16_t)((r_xy&0xFFFF0000)>>16);
				data_y[i] = (uint16_t)(r_xy&0xFFFF);
				data_z[i] = (uint16_t)(r_z&0xFFFF);
			}
			pktNum=0;
			// assign 4 read data value to cdrc data packet
			for (int i=2;i<20;i=i+9)
			{
				p_cal_encoded_buffer[i] = (uint8_t) (data_z[pktNum]& 0xFF) ;
				p_cal_encoded_buffer[i+1] = ((data_z[pktNum]& 0x0F00) >> 8) | ((data_y[pktNum]&0x0F) << 4);
				p_cal_encoded_buffer[i+2] = (uint8_t) ((data_y[pktNum]& 0x0FF0) >> 4) ;
				p_cal_encoded_buffer[i+3] = (uint8_t) (data_x[pktNum]& 0xFF)  ;
				p_cal_encoded_buffer[i+4] = ((data_x[pktNum]& 0x0F00) >> 8) | ((data_z[pktNum+1]&0x0F) << 4);
				p_cal_encoded_buffer[i+5] = (uint8_t) ((data_z[pktNum+1]& 0x0FF0) >> 4) ;
				p_cal_encoded_buffer[i+6] = (uint8_t) (data_y[pktNum+1]& 0xFF) ;
				p_cal_encoded_buffer[i+7] = ((data_y[pktNum+1]& 0x0F00) >> 8) | ((data_x[pktNum+1]&0x0F) << 4);
				p_cal_encoded_buffer[i+8] = (uint8_t) ((data_x[pktNum+1]& 0x0FF0) >> 4) ;
				pktNum += 2;
			}
			printf("ret: %i,Cal data:",ret);
			for(int i=19;i>=0;i--)
			{
				printf("%02X ",p_cal_encoded_buffer[i]);
			}
			printf("\r\n");
			err_code = ble_pbs_cdrc_update(&m_pbs, p_cal_encoded_buffer);
		}

