gillwei/Pioneer_Beacon_nRF51/ble_app_hrs/main.c
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.
	    err_code = app_timer_create(&m_data_header_report_id,
                                APP_TIMER_MODE_REPEATED,
                                dhrc_timeout_handler);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HEART_RATE_SENSOR_HEART_RATE_BELT);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}




/**@brief Function for initializing services that will be used by the application.
 *
 * @details Initialize the Heart Rate, Battery and Device Information services.
 */
static void services_init(void)
{
    uint32_t       err_code;
//		ble_pbs_init_t pbs_init; //No use currently

		m_pbs.evt_handler          = NULL;
		memset(&m_pbs, 0, sizeof(m_pbs));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&m_pbs.pbs_attr_md.read_perm);
		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&m_pbs.pbs_attr_md.write_perm); // Orignally no access
		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&m_pbs.pbs_cccd_md.cccd_write_perm);
		
		// Value setting 
		//bool utc_exist_bit = false;  // bit located in m_pbs.bsc_s.flag 0x10, TBD
		m_pbs.bsc_s.flag = 0x00;
		m_pbs.bsc_s.sampling_frequency = 50;
		m_pbs.bsc_s.ble_output_power = -8;
		m_pbs.bsc_s.current_utc = 0;
		m_pbs.bsc_s.ambient_sensor_value = 0;
		m_pbs.bsc_s.acc_voltage = 0;
		
		m_pbs.tsc_s.small_accident_level_x = 70;
		m_pbs.tsc_s.small_accident_level_y = 60;
		m_pbs.tsc_s.medium_accident_level = 60;
		m_pbs.tsc_s.high_accident_level = 100;
		m_pbs.tsc_s.hard_accelaration_level = 30;
		m_pbs.tsc_s.hard_braking_level = 35;
		m_pbs.tsc_s.hard_steering_level_left = 35;
		m_pbs.tsc_s.hard_steering_level_right= 35;

		// Event Storage Characteristic default value
		m_pbs.esc_s.download_control_point = 0x00;
		m_pbs.esc_s.number_of_event = 0x00;
		// Data Report Header Characteristic default value
		m_pbs.drhc_s.recorded_data_interval = 20;
		m_pbs.drhc_s.recorded_data_resolution = 12;
		m_pbs.drhc_s.recorded_number_of_axis = 3;
		m_pbs.drhc_s.recorded_event_id = 0;
		m_pbs.drhc_s.recorded_event_duration = 10;
		m_pbs.drhc_s.recorded_utc_of_event_start = 0;
		// Calibration Data Log default value
		m_pbs.cdrc_s.data_packet_id = 0;
		m_pbs.cdrc_s.data_packet_length = 18;
		uint8_t default_cdrc_data[18] = {0};
		m_pbs.cdrc_s.data_payload = default_cdrc_data;
		// Raw Data Log default value
		m_pbs.rdrc_s.data_packet_id = 0;
		m_pbs.rdrc_s.data_packet_length = 18;
		uint8_t default_rdrc_data[18] = {0};
		m_pbs.rdrc_s.data_payload = default_rdrc_data;
		
		m_pbs.bdc_s.advertising_period = 64;
		m_pbs.bdc_s.advertising_duration = 4;
		m_pbs.bdc_s.advertising_interval = 100;
		
		m_pbs.bdrc_s.advertising_interval = 100;
		m_pbs.bdrc_s.advertising_time = 5;
		m_pbs.bdrc_s.button_status = 0;
    err_code = ble_pbs_init(&m_pbs);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for initializing the sensor simulators.
 */
//static void sensor_simulator_init(void)
//{
//	  m_drhc_sim_cfg.min          = MIN_DRHC_DATA;
//    m_drhc_sim_cfg.max          = MAX_DRHC_DATA;
//    m_drhc_sim_cfg.incr         = DRHC_INCREMENT;
//    m_drhc_sim_cfg.start_at_max = true;

//    sensorsim_init(&m_drhc_sim_state, &m_drhc_sim_cfg);
//}


/**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers.
		err_code = app_timer_start(m_data_header_report_id, DATA_HEADER_REPORT_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
	
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
		//uint32_t err_code;
		
		// edited by Gill
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        //err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        //APP_ERROR_CHECK(err_code);
			printf("BLE_CONN_PARAMS_EVT_FAILED");
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID; // add for test
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

